Revit 2027 API
CoordinationModelLinkUtils.Reload Method
 Reloads the provided Coordination Model type element.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void Reload(
	Document document,
	ElementType coordinationModelType
)
Public Shared Sub Reload (
	document As Document,
	coordinationModelType As ElementType
)
public:
static void Reload(
	Document^ document,
	ElementType^ coordinationModelType
)
static member Reload :
        document : Document *
        coordinationModelType : ElementType -> unit
Parameters
document Document
 The document.
coordinationModelType ElementType
 The Coordination Model type element to reload.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelType was not found in the given document. -or- The provided element is not a Coordination Model type. -or- This operation is not supported for scenario-based coordination models. Scenario-based coordination models are read-only and their source is managed by the scenario system.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to validate web services environment. -or- Failed to validate user authentication. -or- The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- Failed to reload Coordination Model.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 For a Coordination Model from Autodesk Docs, reload will get the latest version for the provided Coordination Model type element. Authentication in Revit is a prerequisite for reloading Coordination Models from Autodesk Docs.
 This operation is blocked for Coordination Models that originate from a scenario. Scenario-based coordination models are read-only and their source is managed by the scenario system.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace